---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures
source: html/205088f3-3d5f-d559-e777-3c94be4a806b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures

Failures related to parts related to walls.

## Syntax (C#)
```csharp
public static class PartMakerMethodForWallFailures
```